tap "buo/cask-upgrade"
tap "goles/battery"
tap "microsoft/git"
brew "ack"
brew "acpica"
brew "highway"
brew "jpeg-turbo"
brew "zstd"
brew "libtiff"
brew "openexr"
brew "jpeg-xl"
brew "aom"
brew "aws-sdk-cpp"
brew "c-ares"
brew "ca-certificates"
brew "openssl@3"
brew "re2"
brew "grpc"
brew "apache-arrow"
brew "aspell"
brew "assimp"
brew "openssl@1.1"
brew "readline"
brew "autojump"
brew "awscli"
brew "libunistring"
brew "gettext"
brew "ncurses"
brew "bash"
brew "bash-completion"
brew "libgit2"
brew "bat"
brew "bdw-gc"
brew "blueutil"
brew "cairo"
brew "certifi"
brew "pycparser"
brew "cffi"
brew "gmp"
brew "mpfr"
brew "cmake"
brew "cmake-docs"
brew "colordiff"
brew "curl"
brew "freetds"
brew "gd"
brew "libzip"
brew "php"
brew "rtmpdump"
brew "composer"
brew "coreutils"
brew "cryptography"
brew "dark-mode"
brew "dbus"
brew "diff-so-fancy"
brew "direnv"
brew "django-completion"
brew "docker-completion"
brew "dockutil"
brew "docutils"
brew "double-conversion"
brew "dust"
brew "duti"
brew "fd"
brew "findutils"
brew "fonttools"
brew "freexl"
brew "fzf"
brew "gawk"
brew "gcc"
brew "geos"
brew "libevent"
brew "libidn2"
brew "nettle"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "libassuan"
brew "libgcrypt"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "gpgme"
brew "libaec"
brew "pkgconf"
brew "hdf5"
brew "proj"
brew "libheif"
brew "uriparser"
brew "libspatialite"
brew "netcdf"
brew "nss"
brew "numpy"
brew "poppler"
brew "gdal"
brew "gdbm"
brew "gh"
brew "harfbuzz"
brew "pango"
brew "ghostscript"
brew "git"
brew "mercurial"
brew "git-cinnabar"
brew "git-extras"
brew "git-plus", link: false
brew "git-recent"
brew "git-town"
brew "github-keygen"
brew "libuv"
brew "node"
brew "gitmoji"
brew "gnu-sed"
brew "gobject-introspection"
brew "netpbm"
brew "gts"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "grpcurl"
brew "guile"
brew "hexyl"
brew "lua"
brew "highlight"
brew "htop"
brew "httpd"
brew "httpie"
brew "imagemagick"
brew "libraw"
brew "imagemagick-full"
brew "jansson"
brew "jpeg"
brew "jpegoptim"
brew "jq"
brew "keyring"
brew "libdap"
brew "libproxy"
brew "mackup"
brew "mas"
brew "mdcat"
brew "moreutils"
brew "mtr"
brew "protobuf"
brew "mysql"
brew "nghttp2"
brew "nginx"
brew "open-completion"
brew "openjdk"
brew "pandoc"
brew "pip-completion"
brew "poetry"
brew "psgrep"
brew "pyenv"
brew "pygit2"
brew "pygments"
brew "qt"
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "shellcheck"
brew "six"
brew "spatialindex"
brew "speedtest-cli"
brew "stow"
brew "subversion"
brew "tcl-tk"
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "trash", link: true
brew "tree"
brew "ttf2eot"
brew "vim"
brew "virtualenv"
brew "webkit2png"
brew "wget"
brew "wifi-password"
brew "woff2"
brew "yarn"
brew "z3"
brew "zoxide"
brew "zsh"
brew "zsh-completions"
brew "zsh-history-substring-search"
brew "zsh-syntax-highlighting"
brew "goles/battery/battery"
cask "basictex"
cask "db-browser-for-sqlite"
cask "gpg-suite", args: { appdir: "/Applications" }
cask "zoom"
mas "Bear", id: 1091189122
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "Prime Video", id: 545519333
mas "Slack", id: 803453959
mas "Snip", id: 512505421
mas "The Unarchiver", id: 425424353
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
vscode "bajdzis.vscode-database"
vscode "bmewburn.vscode-intelephense-client"
vscode "dart-code.dart-code"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "dual.zsh-completion-script"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "johnstoncode.svn-scm"
vscode "kiteco.kite"
vscode "mrcrowl.hg"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.powershell"
vscode "ms-vscode.sublime-keybindings"
vscode "mtxr.sqltools"
vscode "octref.vetur"
vscode "rebornix.ruby"
vscode "rogalmic.zsh-debug"
vscode "rust-lang.rust"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscodevim.vim"
vscode "wingrunr21.vscode-ruby"
